In [1]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

from numpy.random import randn

In [2]:
ser1 = Series([1, 2, 3, 4], index=['A', 'B', 'C', 'D'])
ser1

A    1
B    2
C    3
D    4
dtype: int64

In [5]:
ser2 = ser1.reindex(['A', 'B', 'C', 'D', 'E', 'F'])
ser2

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
dtype: float64

In [6]:
ser2.reindex(['A', 'B', 'C', 'D', 'E', 'F', 'G'], fill_value=0)

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
G    0.0
dtype: float64

In [7]:
ser3 = Series(['USA', 'Mexico', 'Canada'], index=[0, 5, 10])
ser3

0        USA
5     Mexico
10    Canada
dtype: object

In [8]:
ranger = range(15)

In [9]:
ranger

range(0, 15)

In [12]:
ser3.reindex(ranger, method='ffill')

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [16]:
dframe = DataFrame(randn(25).reshape(5, 5), index=['A', 'B', 'D', 'E', 'F'], 
                   columns=['col1', 'col2', 'col3', 'col4', 'col5'])
dframe

       col1      col2      col3      col4      col5
A -0.497210 -0.266750 -1.443690 -0.249932 -1.554207
B -0.775208  0.544738  0.534699  0.181280  0.242065
D  0.229642 -0.033095  0.953151  0.107469 -0.484885
E  0.236184  1.069244 -1.974276  1.751075  0.306536
F  1.440633  0.773667  0.770103  1.154719  0.604376

In [17]:
dframe2 = dframe.reindex(['A', 'B', 'C', 'D', 'E', 'F'])

In [18]:
dframe2

       col1      col2      col3      col4      col5
A -0.497210 -0.266750 -1.443690 -0.249932 -1.554207
B -0.775208  0.544738  0.534699  0.181280  0.242065
C       NaN       NaN       NaN       NaN       NaN
D  0.229642 -0.033095  0.953151  0.107469 -0.484885
E  0.236184  1.069244 -1.974276  1.751075  0.306536
F  1.440633  0.773667  0.770103  1.154719  0.604376

In [19]:
new_columns = ['col1', 'col2', 'col3', 'col4', 'col5', 'col6']

In [20]:
dframe2.reindex(columns=new_columns)

       col1      col2      col3      col4      col5  col6
A -0.497210 -0.266750 -1.443690 -0.249932 -1.554207   NaN
B -0.775208  0.544738  0.534699  0.181280  0.242065   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D  0.229642 -0.033095  0.953151  0.107469 -0.484885   NaN
E  0.236184  1.069244 -1.974276  1.751075  0.306536   NaN
F  1.440633  0.773667  0.770103  1.154719  0.604376   NaN

In [21]:
dframe

       col1      col2      col3      col4      col5
A -0.497210 -0.266750 -1.443690 -0.249932 -1.554207
B -0.775208  0.544738  0.534699  0.181280  0.242065
D  0.229642 -0.033095  0.953151  0.107469 -0.484885
E  0.236184  1.069244 -1.974276  1.751075  0.306536
F  1.440633  0.773667  0.770103  1.154719  0.604376

In [26]:
dframe.ix[['A', 'B', 'C', 'D', 'E', 'F'], new_columns]

       col1      col2      col3      col4      col5  col6
A -0.497210 -0.266750 -1.443690 -0.249932 -1.554207   NaN
B -0.775208  0.544738  0.534699  0.181280  0.242065   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D  0.229642 -0.033095  0.953151  0.107469 -0.484885   NaN
E  0.236184  1.069244 -1.974276  1.751075  0.306536   NaN
F  1.440633  0.773667  0.770103  1.154719  0.604376   NaN